const a = [1, 2, 3, 4, 5, 6, 7, 8, 9];

const b = ['a', 'b', 'c', 'd'];

console.log(a.length);

////////////////////////////////////////    PUSH    //////////////////////////////////////
// ДОБОВЛЯЯЕТ ЭЛЕМЕНТ В КОНЕЦ МАССИВА и возвращает длину масива
console.log(a.push(10, 22, 33, 44, 55));
console.log(a);

b.push('j', 'e', 'b');
console.log(b);

//////////////////////////////////////////  POP  /////////////////////////////////////
//МЕТОД УДАЛЯЕТ ПОСЛЕДНИЙ ЭЛЕМЕНТЫ В КОНЦЕ МАССИВА

b.pop();
console.log(b);
//выводит какую букву последнюю удалил метод
document.querySelector('.out1').innerHTML = b.pop();
console.log(b);

//УДАЛИТЬ ЭЕМЕНТ ВНУТРИ МАССИВА
delete a[3];
console.log(a);


////////////////////////////////////////     SPLICE     //////////////////////////////
//Удаляет и добовляет элементы в массиве
/*  1 - c какого элемента начинаем делать;
    2 - сколько элементов удаляем 
    3 - может добовлять вместо вырезаного нужный элемент */
a.splice(3, 1, 'hi');
console.log(a);



///////////////////////////   SHIFT    ////////////////////////
// Удаляют первый ЭЛЕМЕНТ МАССИВА 

a.shift();
console.log(a);



/////////////////////////   UNSHIFT    //////////////////////
//ДОБОВЛЯЕТ ЭЛЕМЕНТ В НАЧАЛО МАССИВА 

a.unshift(99);
console.log(a);